In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import linear_model

Problem Statement: Build a model for HR department that can help them decide salaries for future candidates. And predict salaries for following candidates, 2 years experience, 9 test score, 6 interview score and 12 years experience, 10 test score, 10 interview score.
y = mx + b is used to calculate the Linear Regression.

In [2]:
#Load the data
hr_dept = pd.read_csv('hiring.csv')

In [3]:
hr_dept.head(4)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000

## Data Overview

In [4]:
#view the data info
hr_dept.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [5]:
#view the data shape
hr_dept.shape

(8, 4)

In [6]:
#view the data columns
hr_dept.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [111]:
#check for missing data
hr_dept.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [112]:
#View the rows with the missing data in experience column
hr_dept[hr_dept['experience'].isnull()]

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000

In [113]:
#View the row with the missing data in test_score(out of 10) column
hr_dept[hr_dept['test_score(out of 10)'].isnull()]

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
6        ten                    NaN                           7      72000

## Data Cleaning

In [114]:
#find the median of the test_score(out of 10)
mean_test_score = hr_dept['test_score(out of 10)'].mean()
mean_test_score

7.857142857142857

In [115]:
import math

#convert the mean to whole number
mean_test_score = math.floor(hr_dept['test_score(out of 10)'].mean())
mean_test_score

7

In [116]:
#Input the median result into the missing data in test_score(out of 10) zero
hr_dept['test_score(out of 10)'] = hr_dept['test_score(out of 10)'].fillna(mean_test_score)
hr_dept.tail(3)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [117]:
#Fill the missing data in experience column with zero
hr_dept['experience'] = hr_dept['experience'].fillna('zero')
hr_dept.head(3)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000

In [118]:
pip install word2number

Requirement already satisfied: word2number in c:\users\iwuan\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [119]:
from word2number import w2n

In [120]:
#Convert the string data in experience column to number because linear regression make use of numbers
hr_dept['experience'] = hr_dept['experience'].apply(w2n.word_to_num)
hr_dept

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

## Creating the model

In [130]:
#Creating a linear regression class object and fitting the data into the model
reg = linear_model.LinearRegression()
reg.fit(hr_dept[['experience','test_score(out of 10)','interview_score(out of 10)']].values, hr_dept['salary($)'])

LinearRegression()

In [132]:
#predict for 2 years experience, 9 test score, 6 interview score
reg.predict([[2, 9, 6]])

array([53713.86677124])

In [133]:
#predict for  12 years experience, 10 test score, 10 interview score.
reg.predict([[12, 10, 10]])

array([93747.79628651])